Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_umap.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_umap.c
 *    Mcxnex Userland Mapping Routines
 *
 *    Implements all the routines necessary for enabling direct userland
 *    access to the Mcxnex hardware.  This includes all routines necessary for
 *    maintaining the "userland resources database" and all the support routines
 *    for the devmap calls.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/file.h>
#include <sys/avl.h>
#include <sys/sysmacros.h>

#include "mcxnex.h"

/* Mcxnex HCA state pointer (extern) */
extern void *mcxnex_statep;

/* Mcxnex HCA Userland Resource Database (extern) */
extern mcxnex_umap_db_t mcxnex_userland_rsrc_db;

static int mcxnex_umap_uarpg(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, uint64_t offset, size_t *maplen, int *err);
static int mcxnex_umap_cqmem(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, offset_t off, size_t *maplen, int *err);
static int mcxnex_umap_qpmem(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, offset_t off, size_t *maplen, int *err);
static int mcxnex_umap_srqmem(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, offset_t off, size_t *maplen, int *err);
static int mcxnex_umap_dbrecmem(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, offset_t off, size_t *maplen, int *err);
static int mcxnex_devmap_umem_map(devmap_cookie_t dhp, dev_t dev, uint_t flags,
    offset_t off, size_t len, void **pvtp);
static int mcxnex_devmap_umem_dup(devmap_cookie_t dhp, void *pvtp,
    devmap_cookie_t new_dhp, void **new_pvtp);
static void mcxnex_devmap_umem_unmap(devmap_cookie_t dhp, void *pvtp,
    offset_t off, size_t len, devmap_cookie_t new_dhp1, void **pvtp1,
    devmap_cookie_t new_dhp2, void **pvtp2);
static int mcxnex_devmap_dbrecmem_map(devmap_cookie_t dhp, dev_t dev,
    uint_t flags, offset_t off, size_t len, void **pvtp);
static int mcxnex_devmap_dbrecmem_dup(devmap_cookie_t dhp, void *pvtp,
    devmap_cookie_t new_dhp, void **new_pvtp);
static void mcxnex_devmap_dbrecmem_unmap(devmap_cookie_t dhp, void *pvtp,
    offset_t off, size_t len, devmap_cookie_t new_dhp1, void **pvtp1,
    devmap_cookie_t new_dhp2, void **pvtp2);
static int mcxnex_devmap_devmem_map(devmap_cookie_t dhp, dev_t dev,
    uint_t flags, offset_t off, size_t len, void **pvtp);
static int mcxnex_devmap_devmem_dup(devmap_cookie_t dhp, void *pvtp,
    devmap_cookie_t new_dhp, void **new_pvtp);
static void mcxnex_devmap_devmem_unmap(devmap_cookie_t dhp, void *pvtp,
    offset_t off, size_t len, devmap_cookie_t new_dhp1, void **pvtp1,
    devmap_cookie_t new_dhp2, void **pvtp2);
static ibt_status_t mcxnex_umap_mr_data_in(mcxnex_mrhdl_t mr,
    ibt_mr_data_in_t *data, size_t data_sz);
static ibt_status_t mcxnex_umap_cq_data_out(mcxnex_cqhdl_t cq,
    mlnx_umap_cq_data_out_t *data, size_t data_sz);
static ibt_status_t mcxnex_umap_qp_data_out(mcxnex_qphdl_t qp,
    mlnx_umap_qp_data_out_t *data, size_t data_sz);
static ibt_status_t mcxnex_umap_srq_data_out(mcxnex_srqhdl_t srq,
    mlnx_umap_srq_data_out_t *data, size_t data_sz);
static ibt_status_t mcxnex_umap_pd_data_out(mcxnex_pdhdl_t pd,
    mlnx_umap_pd_data_out_t *data, size_t data_sz);
static int mcxnex_umap_db_compare(const void *query, const void *entry);


/*
 * These callbacks are passed to devmap_umem_setup() and devmap_devmem_setup(),
 * respectively.  They are used to handle (among other things) partial
 * unmappings and to provide a method for invalidating mappings inherited
 * as a result of a fork(2) system call.
 */
static struct devmap_callback_ctl mcxnex_devmap_umem_cbops = {
	DEVMAP_OPS_REV,
	mcxnex_devmap_umem_map,
	NULL,
	mcxnex_devmap_umem_dup,
	mcxnex_devmap_umem_unmap
};
static struct devmap_callback_ctl mcxnex_devmap_devmem_cbops = {
	DEVMAP_OPS_REV,
	mcxnex_devmap_devmem_map,
	NULL,
	mcxnex_devmap_devmem_dup,
	mcxnex_devmap_devmem_unmap
};
static struct devmap_callback_ctl mcxnex_devmap_dbrecmem_cbops = {
	DEVMAP_OPS_REV,
	mcxnex_devmap_dbrecmem_map,
	NULL,
	mcxnex_devmap_dbrecmem_dup,
	mcxnex_devmap_dbrecmem_unmap
};

/*
 * mcxnex_devmap()
 *    Context: Can be called from user context.
 */
/* ARGSUSED */
int
mcxnex_devmap(dev_t dev, devmap_cookie_t dhp, offset_t off, size_t len,
    size_t *maplen, uint_t model)
{
	mcxnex_state_t	*state;
	mcxnex_rsrc_t 	*rsrcp;
	minor_t		instance;
	uint64_t	key, value;
	uint64_t	bf_offset = 0;
	uint_t		type;
	int		err, status;

	/* Get Mcxnex softstate structure from instance */
	instance = MCXNEX_DEV_INSTANCE(dev);
	state = ddi_get_soft_state(mcxnex_statep, instance);
	if (state == NULL) {
		return (ENXIO);
	}

	/*
	 * Access to Mcxnex devmap interface is not allowed in
	 * "maintenance mode".
	 */
	if (state->hs_operational_mode == MCXNEX_MAINTENANCE_MODE) {
		return (EFAULT);
	}

	/*
	 * The bottom bits of "offset" are undefined (number depends on
	 * system PAGESIZE).  Shifting these off leaves us with a "key".
	 * The "key" is actually a combination of both a real key value
	 * (for the purpose of database lookup) and a "type" value.  We
	 * extract this information before doing the database lookup.
	 */
	key  = off >> PAGESHIFT;
	type = key & MLNX_UMAP_RSRC_TYPE_MASK;
	key  = key >> MLNX_UMAP_RSRC_TYPE_SHIFT;
	if (type == MLNX_UMAP_BLUEFLAMEPG_RSRC) {
		if (state->hs_devlim.blu_flm == 0) {
			return (EFAULT);
		}
		bf_offset = state->hs_bf_offset;
		type = MLNX_UMAP_UARPG_RSRC;
	}
	status = mcxnex_umap_db_find(instance, key, type, &value, 0, NULL);
	if (status == DDI_SUCCESS) {
		rsrcp = (mcxnex_rsrc_t *)(uintptr_t)value;

		switch (type) {
		case MLNX_UMAP_UARPG_RSRC:
			/*
			 * Double check that process who open()'d Mcxnex is
			 * same process attempting to mmap() UAR page.
			 */
			if (key != ddi_get_pid()) {
				return (EINVAL);
			}

			/* Map the UAR page out for userland access */
			status = mcxnex_umap_uarpg(state, dhp, rsrcp, bf_offset,
			    maplen, &err);
			if (status != DDI_SUCCESS) {
				return (err);
			}
			break;

		case MLNX_UMAP_CQMEM_RSRC:
			/* Map the CQ memory out for userland access */
			status = mcxnex_umap_cqmem(state, dhp, rsrcp, off,
			    maplen, &err);
			if (status != DDI_SUCCESS) {
				return (err);
			}
			break;

		case MLNX_UMAP_QPMEM_RSRC:
			/* Map the QP memory out for userland access */
			status = mcxnex_umap_qpmem(state, dhp, rsrcp, off,
			    maplen, &err);
			if (status != DDI_SUCCESS) {
				return (err);
			}
			break;

		case MLNX_UMAP_SRQMEM_RSRC:
			/* Map the SRQ memory out for userland access */
			status = mcxnex_umap_srqmem(state, dhp, rsrcp, off,
			    maplen, &err);
			if (status != DDI_SUCCESS) {
				return (err);
			}
			break;

		case MLNX_UMAP_DBRMEM_RSRC:
			/*
			 * Map the doorbell record memory out for
			 * userland access
			 */
			status = mcxnex_umap_dbrecmem(state, dhp, rsrcp, off,
			    maplen, &err);
			if (status != DDI_SUCCESS) {
				return (err);
			}
			break;

		default:
			MCXNEX_WARNING(state, "unexpected rsrc type in devmap");
			return (EINVAL);
		}
	} else {
		return (EINVAL);
	}

	return (0);
}


