Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_umap.c
/*
 * mcxnex_umap_uarpg()
 *    Context: Can be called from user context.
 */
static int
mcxnex_umap_uarpg(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, uint64_t offset, size_t *maplen, int *err)
{
	int			status;
	uint_t			maxprot;
	ddi_device_acc_attr_t	*accattrp = &state->hs_reg_accattr;
	ddi_device_acc_attr_t	accattr;

	if (offset != 0) {	/* Mcxnex Blueflame */
		/* Try to use write coalescing data ordering */
		accattr = *accattrp;
		accattr.devacc_attr_dataorder = DDI_STORECACHING_OK_ACC;
		accattrp = &accattr;
	}

	/* Map out the UAR page (doorbell page) */
	maxprot = (PROT_READ | PROT_WRITE | PROT_USER);
	status = devmap_devmem_setup(dhp, state->hs_dip,
	    &mcxnex_devmap_devmem_cbops, MCXNEX_UAR_BAR, (rsrcp->hr_indx <<
	    PAGESHIFT) + offset, PAGESIZE, maxprot, DEVMAP_ALLOW_REMAP,
	    accattrp);
	if (status < 0) {
		*err = status;
		return (DDI_FAILURE);
	}

	*maplen = PAGESIZE;
	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_cqmem()
 *    Context: Can be called from user context.
 */
/* ARGSUSED */
static int
mcxnex_umap_cqmem(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, offset_t off, size_t *maplen, int *err)
{
	mcxnex_cqhdl_t	cq;
	size_t		size;
	uint_t		maxprot;
	int		status;

	/* Extract the Mcxnex CQ handle pointer from the mcxnex_rsrc_t */
	cq = (mcxnex_cqhdl_t)rsrcp->hr_addr;

	/* Round-up the CQ size to system page size */
	size = ptob(btopr(cq->cq_resize_hdl ?
	    cq->cq_resize_hdl->cq_cqinfo.qa_size : cq->cq_cqinfo.qa_size));

	/* Map out the CQ memory - use resize_hdl if non-NULL */
	maxprot = (PROT_READ | PROT_WRITE | PROT_USER);
	status = devmap_umem_setup(dhp, state->hs_dip,
	    &mcxnex_devmap_umem_cbops, cq->cq_resize_hdl ?
	    cq->cq_resize_hdl->cq_cqinfo.qa_umemcookie :
	    cq->cq_cqinfo.qa_umemcookie, 0, size,
	    maxprot, (DEVMAP_ALLOW_REMAP | DEVMAP_DEFAULTS), NULL);
	if (status < 0) {
		*err = status;
		return (DDI_FAILURE);
	}
	*maplen = size;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_qpmem()
 *    Context: Can be called from user context.
 */
/* ARGSUSED */
static int
mcxnex_umap_qpmem(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, offset_t off, size_t *maplen, int *err)
{
	mcxnex_qphdl_t	qp;
	offset_t	offset;
	size_t		size;
	uint_t		maxprot;
	int		status;

	/* Extract the Mcxnex QP handle pointer from the mcxnex_rsrc_t */
	qp = (mcxnex_qphdl_t)rsrcp->hr_addr;

	/*
	 * Calculate the offset of the first work queue (send or recv) into
	 * the memory (ddi_umem_alloc()) allocated previously for the QP.
	 */
	offset = (offset_t)((uintptr_t)qp->qp_wqinfo.qa_buf_aligned -
	    (uintptr_t)qp->qp_wqinfo.qa_buf_real);

	/* Round-up the QP work queue sizes to system page size */
	size = ptob(btopr(qp->qp_wqinfo.qa_size));

	/* Map out the QP memory */
	maxprot = (PROT_READ | PROT_WRITE | PROT_USER);
	status = devmap_umem_setup(dhp, state->hs_dip,
	    &mcxnex_devmap_umem_cbops, qp->qp_wqinfo.qa_umemcookie, offset,
	    size, maxprot, (DEVMAP_ALLOW_REMAP | DEVMAP_DEFAULTS), NULL);
	if (status < 0) {
		*err = status;
		return (DDI_FAILURE);
	}
	*maplen = size;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_srqmem()
 *    Context: Can be called from user context.
 */
/* ARGSUSED */
static int
mcxnex_umap_srqmem(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, offset_t off, size_t *maplen, int *err)
{
	mcxnex_srqhdl_t	srq;
	offset_t	offset;
	size_t		size;
	uint_t		maxprot;
	int		status;

	/* Extract the Mcxnex SRQ handle pointer from the mcxnex_rsrc_t */
	srq = (mcxnex_srqhdl_t)rsrcp->hr_addr;

	/*
	 * Calculate the offset of the first shared recv queue into the memory
	 * (ddi_umem_alloc()) allocated previously for the SRQ.
	 */
	offset = (offset_t)((uintptr_t)srq->srq_wqinfo.qa_buf_aligned -
	    (uintptr_t)srq->srq_wqinfo.qa_buf_real);

	/* Round-up the SRQ work queue sizes to system page size */
	size = ptob(btopr(srq->srq_wqinfo.qa_size));

	/* Map out the SRQ memory */
	maxprot = (PROT_READ | PROT_WRITE | PROT_USER);
	status = devmap_umem_setup(dhp, state->hs_dip,
	    &mcxnex_devmap_umem_cbops, srq->srq_wqinfo.qa_umemcookie, offset,
	    size, maxprot, (DEVMAP_ALLOW_REMAP | DEVMAP_DEFAULTS), NULL);
	if (status < 0) {
		*err = status;
		return (DDI_FAILURE);
	}
	*maplen = size;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_devmap_dbrecmem()
 *    Context: Can be called from user context.
 */
/* ARGSUSED */
static int
mcxnex_umap_dbrecmem(mcxnex_state_t *state, devmap_cookie_t dhp,
    mcxnex_rsrc_t *rsrcp, offset_t off, size_t *maplen, int *err)
{
	mcxnex_udbr_page_t *pagep;
	offset_t	offset;
	size_t		size;
	uint_t		maxprot;
	int		status;

	/* We stored the udbr_page pointer, and not a mcxnex_rsrc_t */
	pagep = (mcxnex_udbr_page_t *)rsrcp;

	/*
	 * Calculate the offset of the doorbell records into the memory
	 * (ddi_umem_alloc()) allocated previously for them.
	 */
	offset = 0;

	/* Round-up the doorbell page to system page size */
	size = PAGESIZE;

	/* Map out the Doorbell Record memory */
	maxprot = (PROT_READ | PROT_WRITE | PROT_USER);
	status = devmap_umem_setup(dhp, state->hs_dip,
	    &mcxnex_devmap_dbrecmem_cbops, pagep->upg_umemcookie, offset,
	    size, maxprot, (DEVMAP_ALLOW_REMAP | DEVMAP_DEFAULTS), NULL);
	if (status < 0) {
		*err = status;
		return (DDI_FAILURE);
	}
	*maplen = size;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_devmap_umem_map()
 *    Context: Can be called from kernel context.
 */
/* ARGSUSED */
static int
mcxnex_devmap_umem_map(devmap_cookie_t dhp, dev_t dev, uint_t flags,
    offset_t off, size_t len, void **pvtp)
{
	mcxnex_state_t		*state;
	mcxnex_devmap_track_t	*dvm_track;
	mcxnex_cqhdl_t		cq;
	mcxnex_qphdl_t		qp;
	mcxnex_srqhdl_t		srq;
	minor_t			instance;
	uint64_t		key;
	uint_t			type;

	/* Get Mcxnex softstate structure from instance */
	instance = MCXNEX_DEV_INSTANCE(dev);
	state = ddi_get_soft_state(mcxnex_statep, instance);
	if (state == NULL) {
		return (ENXIO);
	}

	/*
	 * The bottom bits of "offset" are undefined (number depends on
	 * system PAGESIZE).  Shifting these off leaves us with a "key".
	 * The "key" is actually a combination of both a real key value
	 * (for the purpose of database lookup) and a "type" value.  Although
	 * we are not going to do any database lookup per se, we do want
	 * to extract the "key" and the "type" (to enable faster lookup of
	 * the appropriate CQ or QP handle).
	 */
	key  = off >> PAGESHIFT;
	type = key & MLNX_UMAP_RSRC_TYPE_MASK;
	key  = key >> MLNX_UMAP_RSRC_TYPE_SHIFT;

