Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_umap.c
	case IBT_HDL_PD:
		status = mcxnex_umap_pd_data_out((mcxnex_pdhdl_t)hdl,
		    (mlnx_umap_pd_data_out_t *)data_p, data_sz);
		if (status != DDI_SUCCESS) {
			return (status);
		}
		break;

	/*
	 * For other possible valid IBT types, we return IBT_NOT_SUPPORTED,
	 * since the Mcxnex driver does not support these.
	 */
	case IBT_HDL_HCA:
	case IBT_HDL_MR:
	case IBT_HDL_MW:
	case IBT_HDL_AH:
	case IBT_HDL_SCHED:
	case IBT_HDL_EEC:
	case IBT_HDL_RDD:
		return (IBT_NOT_SUPPORTED);

	/*
	 * Any other types are invalid.
	 */
	default:
		return (IBT_INVALID_PARAM);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_cq_data_out()
 *    Context: Can be called from user or kernel context.
 */
static ibt_status_t
mcxnex_umap_cq_data_out(mcxnex_cqhdl_t cq, mlnx_umap_cq_data_out_t *data,
    size_t data_sz)
{
	/* Check for valid CQ handle pointer */
	if (cq == NULL) {
		return (IBT_CQ_HDL_INVALID);
	}

	/* Check for valid CQ mapping structure size */
	if (data_sz < sizeof (mlnx_umap_cq_data_out_t)) {
		return (IBT_INSUFF_RESOURCE);
	}
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*data))

	/* deal with cq_alloc() verses cq_resize() */
	if (cq->cq_resize_hdl) {
		data->mcq_maplen = cq->cq_resize_hdl->cq_cqinfo.qa_size;
		data->mcq_numcqe = cq->cq_resize_hdl->cq_bufsz;
	} else {
		data->mcq_maplen = cq->cq_cqinfo.qa_size;
		data->mcq_numcqe = cq->cq_bufsz;
	}

	/*
	 * If it has passed all the above checks, then fill in all the useful
	 * mapping information (including the mapping offset that will be
	 * passed back to the devmap() interface during a subsequent mmap()
	 * call.
	 *
	 * The "offset" for CQ mmap()'s looks like this:
	 * +----------------------------------------+--------+--------------+
	 * |		   CQ Number		    |  0x33  | Reserved (0) |
	 * +----------------------------------------+--------+--------------+
	 *	   (64 - 8 - PAGESHIFT) bits	    8 bits	PAGESHIFT bits
	 *
	 * This returns information about the mapping offset, the length of
	 * the CQ memory, the CQ number (for use in later CQ doorbells), the
	 * number of CQEs the CQ memory can hold, and the size of each CQE.
	 */
	data->mcq_rev			= MLNX_UMAP_IF_VERSION;
	data->mcq_mapoffset		= ((((uint64_t)cq->cq_cqnum <<
	    MLNX_UMAP_RSRC_TYPE_SHIFT) | MLNX_UMAP_CQMEM_RSRC) << PAGESHIFT);
	data->mcq_cqnum			= cq->cq_cqnum;
	data->mcq_cqesz			= sizeof (mcxnex_hw_cqe_t);

	/* doorbell record fields */
	data->mcq_polldbr_mapoffset	= cq->cq_dbr_mapoffset;
	data->mcq_polldbr_maplen	= PAGESIZE;
	data->mcq_polldbr_offset	= (uintptr_t)cq->cq_arm_ci_vdbr &
	    PAGEOFFSET;
	data->mcq_armdbr_mapoffset	= cq->cq_dbr_mapoffset;
	data->mcq_armdbr_maplen		= PAGESIZE;
	data->mcq_armdbr_offset		= data->mcq_polldbr_offset + 4;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_qp_data_out()
 *    Context: Can be called from user or kernel context.
 */
static ibt_status_t
mcxnex_umap_qp_data_out(mcxnex_qphdl_t qp, mlnx_umap_qp_data_out_t *data,
    size_t data_sz)
{
	/* Check for valid QP handle pointer */
	if (qp == NULL) {
		return (IBT_QP_HDL_INVALID);
	}

	/* Check for valid QP mapping structure size */
	if (data_sz < sizeof (mlnx_umap_qp_data_out_t)) {
		return (IBT_INSUFF_RESOURCE);
	}
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*data))

	/*
	 * If it has passed all the checks, then fill in all the useful
	 * mapping information (including the mapping offset that will be
	 * passed back to the devmap() interface during a subsequent mmap()
	 * call.
	 *
	 * The "offset" for QP mmap()'s looks like this:
	 * +----------------------------------------+--------+--------------+
	 * |		   QP Number		    |  0x44  | Reserved (0) |
	 * +----------------------------------------+--------+--------------+
	 *	   (64 - 8 - PAGESHIFT) bits	    8 bits	PAGESHIFT bits
	 *
	 * This returns information about the mapping offset, the length of
	 * the QP memory, and the QP number (for use in later send and recv
	 * doorbells).  It also returns the following information for both
	 * the receive work queue and the send work queue, respectively:  the
	 * offset (from the base mapped address) of the start of the given
	 * work queue, the 64-bit IB virtual address that corresponds to
	 * the base mapped address (needed for posting WQEs though the
	 * QP doorbells), the number of WQEs the given work queue can hold,
	 * and the size of each WQE for the given work queue.
	 */
	data->mqp_rev		= MLNX_UMAP_IF_VERSION;
	data->mqp_mapoffset	= ((((uint64_t)qp->qp_qpnum <<
	    MLNX_UMAP_RSRC_TYPE_SHIFT) | MLNX_UMAP_QPMEM_RSRC) << PAGESHIFT);
	data->mqp_maplen	= qp->qp_wqinfo.qa_size;
	data->mqp_qpnum		= qp->qp_qpnum;

	/*
	 * If this QP is associated with a shared receive queue (SRQ),
	 * then return invalid RecvQ parameters.  Otherwise, return
	 * the proper parameter values.
	 */
	if (qp->qp_srq_en == MCXNEX_QP_SRQ_ENABLED) {
		data->mqp_rq_off	= (uint32_t)qp->qp_wqinfo.qa_size;
		data->mqp_rq_desc_addr	= (uint32_t)qp->qp_wqinfo.qa_size;
		data->mqp_rq_numwqe	= 0;
		data->mqp_rq_wqesz	= 0;
		data->mqp_rdbr_mapoffset = 0;
		data->mqp_rdbr_maplen	= 0;
		data->mqp_rdbr_offset	= 0;
	} else {
		data->mqp_rq_off	= (uintptr_t)qp->qp_rq_buf -
		    (uintptr_t)qp->qp_wqinfo.qa_buf_aligned;
		data->mqp_rq_desc_addr	= (uint32_t)((uintptr_t)qp->qp_rq_buf -
		    qp->qp_desc_off);
		data->mqp_rq_numwqe	= qp->qp_rq_bufsz;
		data->mqp_rq_wqesz	= (1 << qp->qp_rq_log_wqesz);

		/* doorbell record fields */
		data->mqp_rdbr_mapoffset = qp->qp_rdbr_mapoffset;
		data->mqp_rdbr_maplen	= PAGESIZE;
		data->mqp_rdbr_offset	= (uintptr_t)qp->qp_rq_vdbr &
		    PAGEOFFSET;
	}
	data->mqp_sq_off		= (uintptr_t)qp->qp_sq_buf -
	    (uintptr_t)qp->qp_wqinfo.qa_buf_aligned;
	data->mqp_sq_desc_addr	= (uint32_t)((uintptr_t)qp->qp_sq_buf -
	    qp->qp_desc_off);
	data->mqp_sq_numwqe	= qp->qp_sq_bufsz;
	data->mqp_sq_wqesz	= (1 << qp->qp_sq_log_wqesz);
	data->mqp_sq_headroomwqes = qp->qp_sq_hdrmwqes;

	/* doorbell record fields */
	data->mqp_sdbr_mapoffset = 0;
	data->mqp_sdbr_maplen	= 0;
	data->mqp_sdbr_offset	= 0;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_srq_data_out()
 *    Context: Can be called from user or kernel context.
 */
static ibt_status_t
mcxnex_umap_srq_data_out(mcxnex_srqhdl_t srq, mlnx_umap_srq_data_out_t *data,
    size_t data_sz)
{
	/* Check for valid SRQ handle pointer */
	if (srq == NULL) {
		return (IBT_SRQ_HDL_INVALID);
	}

	/* Check for valid SRQ mapping structure size */
	if (data_sz < sizeof (mlnx_umap_srq_data_out_t)) {
		return (IBT_INSUFF_RESOURCE);
	}
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*data))

