Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_umap.c
	/*
	 * If it has passed all the checks, then fill in all the useful
	 * mapping information (including the mapping offset that will be
	 * passed back to the devmap() interface during a subsequent mmap()
	 * call.
	 *
	 * The "offset" for SRQ mmap()'s looks like this:
	 * +----------------------------------------+--------+--------------+
	 * |		   SRQ Number		    |  0x66  | Reserved (0) |
	 * +----------------------------------------+--------+--------------+
	 *	   (64 - 8 - PAGESHIFT) bits	    8 bits	PAGESHIFT bits
	 *
	 * This returns information about the mapping offset, the length of the
	 * SRQ memory, and the SRQ number (for use in later send and recv
	 * doorbells).  It also returns the following information for the
	 * shared receive queue: the offset (from the base mapped address) of
	 * the start of the given work queue, the 64-bit IB virtual address
	 * that corresponds to the base mapped address (needed for posting WQEs
	 * though the QP doorbells), the number of WQEs the given work queue
	 * can hold, and the size of each WQE for the given work queue.
	 */
	data->msrq_rev		= MLNX_UMAP_IF_VERSION;
	data->msrq_mapoffset	= ((((uint64_t)srq->srq_srqnum <<
	    MLNX_UMAP_RSRC_TYPE_SHIFT) | MLNX_UMAP_SRQMEM_RSRC) << PAGESHIFT);
	data->msrq_maplen	= srq->srq_wqinfo.qa_size;
	data->msrq_srqnum	= srq->srq_srqnum;

	data->msrq_desc_addr	= (uint32_t)((uintptr_t)srq->srq_wq_buf -
	    srq->srq_desc_off);
	data->msrq_numwqe	= srq->srq_wq_bufsz;
	data->msrq_wqesz	= (1 << srq->srq_wq_log_wqesz);

	/* doorbell record fields */
	data->msrq_rdbr_mapoffset = srq->srq_rdbr_mapoffset;
	data->msrq_rdbr_maplen	= PAGESIZE;
	data->msrq_rdbr_offset	= (uintptr_t)srq->srq_wq_vdbr &
	    PAGEOFFSET;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_pd_data_out()
 *    Context: Can be called from user or kernel context.
 */
static ibt_status_t
mcxnex_umap_pd_data_out(mcxnex_pdhdl_t pd, mlnx_umap_pd_data_out_t *data,
    size_t data_sz)
{
	/* Check for valid PD handle pointer */
	if (pd == NULL) {
		return (IBT_PD_HDL_INVALID);
	}

	/* Check for valid PD mapping structure size */
	if (data_sz < sizeof (mlnx_umap_pd_data_out_t)) {
		return (IBT_INSUFF_RESOURCE);
	}
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*data))

	/*
	 * If it has passed all the checks, then fill the PD table index
	 * (the PD table allocated index for the PD pd_pdnum).
	 */
	data->mpd_rev		= MLNX_UMAP_IF_VERSION;
	data->mpd_pdnum		= pd->pd_pdnum;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_db_init()
 *    Context: Only called from attach() path context
 */
void
mcxnex_umap_db_init(void)
{
	/*
	 * Initialize the lock used by the Mcxnex "userland resources database"
	 * This is used to ensure atomic access to add, remove, and find
	 * entries in the database.
	 */
	mutex_init(&mcxnex_userland_rsrc_db.hdl_umapdb_lock, NULL,
	    MUTEX_DRIVER, NULL);

	/*
	 * Initialize the AVL tree used for the "userland resources
	 * database".  Using an AVL tree here provides the ability to
	 * scale the database size to large numbers of resources.  The
	 * entries in the tree are "mcxnex_umap_db_entry_t" (see
	 * mcxnex_umap.h).  The tree is searched with the help of the
	 * mcxnex_umap_db_compare() routine.
	 */
	avl_create(&mcxnex_userland_rsrc_db.hdl_umapdb_avl,
	    mcxnex_umap_db_compare, sizeof (mcxnex_umap_db_entry_t),
	    offsetof(mcxnex_umap_db_entry_t, hdbe_avlnode));
}


/*
 * mcxnex_umap_db_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
void
mcxnex_umap_db_fini(void)
{
	/* Destroy the AVL tree for the "userland resources database" */
	avl_destroy(&mcxnex_userland_rsrc_db.hdl_umapdb_avl);

	/* Destroy the lock for the "userland resources database" */
	mutex_destroy(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
}


/*
 * mcxnex_umap_db_alloc()
 *    Context: Can be called from user or kernel context.
 */
mcxnex_umap_db_entry_t *
mcxnex_umap_db_alloc(uint_t instance, uint64_t key, uint_t type, uint64_t value)
{
	mcxnex_umap_db_entry_t	*umapdb;

	/* Allocate an entry to add to the "userland resources database" */
	umapdb = kmem_zalloc(sizeof (mcxnex_umap_db_entry_t), KM_NOSLEEP);
	if (umapdb == NULL) {
		return (NULL);
	}
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*umapdb))

	/* Fill in the fields in the database entry */
	umapdb->hdbe_common.hdb_instance  = instance;
	umapdb->hdbe_common.hdb_type	  = type;
	umapdb->hdbe_common.hdb_key	  = key;
	umapdb->hdbe_common.hdb_value	  = value;

	return (umapdb);
}


/*
 * mcxnex_umap_db_free()
 *    Context: Can be called from user or kernel context.
 */
void
mcxnex_umap_db_free(mcxnex_umap_db_entry_t *umapdb)
{
	/* Free the database entry */
	kmem_free(umapdb, sizeof (mcxnex_umap_db_entry_t));
}


/*
 * mcxnex_umap_db_add()
 *    Context: Can be called from user or kernel context.
 */
void
mcxnex_umap_db_add(mcxnex_umap_db_entry_t *umapdb)
{
	mutex_enter(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	mcxnex_umap_db_add_nolock(umapdb);
	mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
}


/*
 * mcxnex_umap_db_add_nolock()
 *    Context: Can be called from user or kernel context.
 */
void
mcxnex_umap_db_add_nolock(mcxnex_umap_db_entry_t *umapdb)
{
	mcxnex_umap_db_query_t	query;
	avl_index_t		where;

	ASSERT(MUTEX_HELD(&mcxnex_userland_rsrc_db.hdl_umapdb_lock));

	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*umapdb))

	/*
	 * Copy the common portion of the "to-be-added" database entry
	 * into the "mcxnex_umap_db_query_t" structure.  We use this structure
	 * (with no flags set) to find the appropriate location in the
	 * "userland resources database" for the new entry to be added.
	 *
	 * Note: we expect that this entry should not be found in the
	 * database (unless something bad has happened).
	 */
	query.hqdb_common = umapdb->hdbe_common;
	query.hqdb_flags  = 0;
	(void) avl_find(&mcxnex_userland_rsrc_db.hdl_umapdb_avl, &query,
	    &where);

	/*
	 * Now, using the "where" field from the avl_find() operation
	 * above, we will insert the new database entry ("umapdb").
	 */
	avl_insert(&mcxnex_userland_rsrc_db.hdl_umapdb_avl, umapdb,
	    where);
}


