Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_umap.c
/*
 * mcxnex_umap_db_find()
 *    Context: Can be called from user or kernel context.
 */
int
mcxnex_umap_db_find(uint_t instance, uint64_t key, uint_t type,
    uint64_t *value, uint_t flag, mcxnex_umap_db_entry_t	**umapdb)
{
	int	status;

	mutex_enter(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	status = mcxnex_umap_db_find_nolock(instance, key, type, value, flag,
	    umapdb);
	mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);

	return (status);
}


/*
 * mcxnex_umap_db_find_nolock()
 *    Context: Can be called from user or kernel context.
 */
int
mcxnex_umap_db_find_nolock(uint_t instance, uint64_t key, uint_t type,
    uint64_t *value, uint_t flags, mcxnex_umap_db_entry_t **umapdb)
{
	mcxnex_umap_db_query_t	query;
	mcxnex_umap_db_entry_t	*entry;
	avl_index_t		where;

	ASSERT(MUTEX_HELD(&mcxnex_userland_rsrc_db.hdl_umapdb_lock));

	/*
	 * Fill in key, type, instance, and flags values of the
	 * mcxnex_umap_db_query_t in preparation for the database
	 * lookup.
	 */
	query.hqdb_flags		= flags;
	query.hqdb_common.hdb_key	= key;
	query.hqdb_common.hdb_type	= type;
	query.hqdb_common.hdb_instance	= instance;

	/*
	 * Perform the database query.  If no entry is found, then
	 * return failure, else continue.
	 */
	entry = (mcxnex_umap_db_entry_t *)avl_find(
	    &mcxnex_userland_rsrc_db.hdl_umapdb_avl, &query, &where);
	if (entry == NULL) {
		return (DDI_FAILURE);
	}
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*entry))

	/*
	 * If the flags argument specifies that the entry should
	 * be removed if found, then call avl_remove() to remove
	 * the entry from the database.
	 */
	if (flags & MCXNEX_UMAP_DB_REMOVE) {

		avl_remove(&mcxnex_userland_rsrc_db.hdl_umapdb_avl, entry);

		/*
		 * The database entry is returned with the expectation
		 * that the caller will use mcxnex_umap_db_free() to
		 * free the entry's memory.  ASSERT that this is non-NULL.
		 * NULL pointer should never be passed for the
		 * MCXNEX_UMAP_DB_REMOVE case.
		 */
		ASSERT(umapdb != NULL);
	}

	/*
	 * If the caller would like visibility to the database entry
	 * (indicated through the use of a non-NULL "umapdb" argument),
	 * then fill it in.
	 */
	if (umapdb != NULL) {
		*umapdb = entry;
	}

	/* Extract value field from database entry and return success */
	*value = entry->hdbe_common.hdb_value;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_umemlock_cb()
 *    Context: Can be called from callback context.
 */
void
mcxnex_umap_umemlock_cb(ddi_umem_cookie_t *umem_cookie)
{
	mcxnex_umap_db_entry_t	*umapdb;
	mcxnex_state_t		*state;
	mcxnex_rsrc_t 		*rsrcp;
	mcxnex_mrhdl_t		mr;
	uint64_t		value;
	uint_t			instance;
	int			status;
	void			(*mr_callback)(void *, void *);
	void			*mr_cbarg1, *mr_cbarg2;

	/*
	 * If this was userland memory, then we need to remove its entry
	 * from the "userland resources database".  Note:  We use the
	 * MCXNEX_UMAP_DB_IGNORE_INSTANCE flag here because we don't know
	 * which instance was used when the entry was added (but we want
	 * to know after the entry is found using the other search criteria).
	 */
	status = mcxnex_umap_db_find(0, (uint64_t)(uintptr_t)umem_cookie,
	    MLNX_UMAP_MRMEM_RSRC, &value, (MCXNEX_UMAP_DB_REMOVE |
	    MCXNEX_UMAP_DB_IGNORE_INSTANCE), &umapdb);
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*umapdb))
	if (status == DDI_SUCCESS) {
		instance = umapdb->hdbe_common.hdb_instance;
		state = ddi_get_soft_state(mcxnex_statep, instance);
		if (state == NULL) {
			cmn_err(CE_WARN, "Unable to match Mcxnex instance\n");
			return;
		}

		/* Free the database entry */
		mcxnex_umap_db_free(umapdb);

		/* Use "value" to convert to an MR handle */
		rsrcp = (mcxnex_rsrc_t *)(uintptr_t)value;
		mr = (mcxnex_mrhdl_t)rsrcp->hr_addr;

		/*
		 * If a callback has been provided, call it first.  This
		 * callback is expected to do any cleanup necessary to
		 * guarantee that the subsequent MR deregister (below)
		 * will succeed.  Specifically, this means freeing up memory
		 * windows which might have been associated with the MR.
		 */
		mutex_enter(&mr->mr_lock);
		mr_callback = mr->mr_umem_cbfunc;
		mr_cbarg1   = mr->mr_umem_cbarg1;
		mr_cbarg2   = mr->mr_umem_cbarg2;
		mutex_exit(&mr->mr_lock);
		if (mr_callback != NULL) {
			mr_callback(mr_cbarg1, mr_cbarg2);
		}

		/*
		 * Then call mcxnex_mr_deregister() to release the resources
		 * associated with the MR handle.  Note: Because this routine
		 * will also check for whether the ddi_umem_cookie_t is in the
		 * database, it will take responsibility for disabling the
		 * memory region and calling ddi_umem_unlock().
		 */
		status = mcxnex_mr_deregister(state, &mr, MCXNEX_MR_DEREG_ALL,
		    DDI_SLEEP);
		if (status != DDI_SUCCESS) {
			MCXNEX_WARNING(state, "Unexpected failure in "
			    "deregister from callback\n");
		}
	}
}


/*
 * mcxnex_umap_db_compare()
 *    Context: Can be called from user or kernel context.
 */
static int
mcxnex_umap_db_compare(const void *q, const void *e)
{
	mcxnex_umap_db_common_t	*entry_common, *query_common;
	uint_t			query_flags;

	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*((mcxnex_umap_db_query_t *)q)))

	entry_common = &((mcxnex_umap_db_entry_t *)e)->hdbe_common;
	query_common = &((mcxnex_umap_db_query_t *)q)->hqdb_common;
	query_flags  = ((mcxnex_umap_db_query_t *)q)->hqdb_flags;

	/*
	 * The first comparison is done on the "key" value in "query"
	 * and "entry".  If they are not equal, then the appropriate
	 * search direction is returned.  Else, we continue by
	 * comparing "type".
	 */
	if (query_common->hdb_key < entry_common->hdb_key) {
		return (-1);
	} else if (query_common->hdb_key > entry_common->hdb_key) {
		return (+1);
	}

	/*
	 * If the search reaches this point, then "query" and "entry"
	 * have equal key values.  So we continue be comparing their
	 * "type" values.  Again, if they are not equal, then the
	 * appropriate search direction is returned.  Else, we continue
	 * by comparing "instance".
	 */
	if (query_common->hdb_type < entry_common->hdb_type) {
		return (-1);
	} else if (query_common->hdb_type > entry_common->hdb_type) {
		return (+1);
	}

