Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_umap.c
	/*
	 * If the search reaches this point, then "query" and "entry"
	 * have exactly the same key and type values.  Now we consult
	 * the "flags" field in the query to determine whether the
	 * "instance" is relevant to the search.  If the
	 * MCXNEX_UMAP_DB_IGNORE_INSTANCE flags is set, then return
	 * success (0) here.  Otherwise, continue the search by comparing
	 * instance values and returning the appropriate search direction.
	 */
	if (query_flags & MCXNEX_UMAP_DB_IGNORE_INSTANCE) {
		return (0);
	}

	/*
	 * If the search has reached this point, then "query" and "entry"
	 * can only be differentiated by their instance values.  If these
	 * are not equal, then return the appropriate search direction.
	 * Else, we return success (0).
	 */
	if (query_common->hdb_instance < entry_common->hdb_instance) {
		return (-1);
	} else if (query_common->hdb_instance > entry_common->hdb_instance) {
		return (+1);
	}

	/* Everything matches... so return success */
	return (0);
}


/*
 * mcxnex_umap_db_set_onclose_cb()
 *    Context: Can be called from user or kernel context.
 */
int
mcxnex_umap_db_set_onclose_cb(dev_t dev, uint64_t flag,
    int (*callback)(void *), void *arg)
{
	mcxnex_umap_db_priv_t	*priv;
	mcxnex_umap_db_entry_t	*umapdb;
	minor_t			instance;
	uint64_t		value;
	int			status;

	instance = MCXNEX_DEV_INSTANCE(dev);
	if (instance == (minor_t)-1) {
		return (DDI_FAILURE);
	}

	if (flag != MCXNEX_ONCLOSE_FLASH_INPROGRESS) {
		return (DDI_FAILURE);
	}

	/*
	 * Grab the lock for the "userland resources database" and find
	 * the entry corresponding to this minor number.  Once it's found,
	 * allocate (if necessary) and add an entry (in the "hdb_priv"
	 * field) to indicate that further processing may be needed during
	 * Mcxnex's close() handling.
	 */
	mutex_enter(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	status = mcxnex_umap_db_find_nolock(instance, dev,
	    MLNX_UMAP_PID_RSRC, &value, 0, &umapdb);
	if (status != DDI_SUCCESS) {
		mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
		return (DDI_FAILURE);
	}

	priv = (mcxnex_umap_db_priv_t *)umapdb->hdbe_common.hdb_priv;
	if (priv == NULL) {
		priv = (mcxnex_umap_db_priv_t *)kmem_zalloc(
		    sizeof (mcxnex_umap_db_priv_t), KM_NOSLEEP);
		if (priv == NULL) {
			mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
			return (DDI_FAILURE);
		}
	}

	/*
	 * Save away the callback and argument to be used during Mcxnex's
	 * close() processing.
	 */
	priv->hdp_cb	= callback;
	priv->hdp_arg	= arg;

	umapdb->hdbe_common.hdb_priv = (void *)priv;
	mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);

	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_db_clear_onclose_cb()
 *    Context: Can be called from user or kernel context.
 */
int
mcxnex_umap_db_clear_onclose_cb(dev_t dev, uint64_t flag)
{
	mcxnex_umap_db_priv_t	*priv;
	mcxnex_umap_db_entry_t	*umapdb;
	minor_t			instance;
	uint64_t		value;
	int			status;

	instance = MCXNEX_DEV_INSTANCE(dev);
	if (instance == (minor_t)-1) {
		return (DDI_FAILURE);
	}

	if (flag != MCXNEX_ONCLOSE_FLASH_INPROGRESS) {
		return (DDI_FAILURE);
	}

	/*
	 * Grab the lock for the "userland resources database" and find
	 * the entry corresponding to this minor number.  Once it's found,
	 * remove the entry (in the "hdb_priv" field) that indicated the
	 * need for further processing during Mcxnex's close().  Free the
	 * entry, if appropriate.
	 */
	mutex_enter(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	status = mcxnex_umap_db_find_nolock(instance, dev,
	    MLNX_UMAP_PID_RSRC, &value, 0, &umapdb);
	if (status != DDI_SUCCESS) {
		mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
		return (DDI_FAILURE);
	}

	priv = (mcxnex_umap_db_priv_t *)umapdb->hdbe_common.hdb_priv;
	if (priv != NULL) {
		kmem_free(priv, sizeof (mcxnex_umap_db_priv_t));
		priv = NULL;
	}

	umapdb->hdbe_common.hdb_priv = (void *)priv;
	mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	return (DDI_SUCCESS);
}


/*
 * mcxnex_umap_db_clear_onclose_cb()
 *    Context: Can be called from user or kernel context.
 */
int
mcxnex_umap_db_handle_onclose_cb(mcxnex_umap_db_priv_t *priv)
{
	int	(*callback)(void *);

	ASSERT(MUTEX_HELD(&mcxnex_userland_rsrc_db.hdl_umapdb_lock));

	/*
	 * Call the callback.
	 *    Note: Currently there is only one callback (in "hdp_cb"), but
	 *    in the future there may be more, depending on what other types
	 *    of interaction there are between userland processes and the
	 *    driver.
	 */
	callback = priv->hdp_cb;
	return (callback(priv->hdp_arg));
}
